# С л о в а р ь
my_dict = {"Анастасия" : 1990, "Сергей" : 1987, "Савва" : 2017}
print ("Словарь:", my_dict)
print ("День рождения:", my_dict["Анастасия"], "г." )
print ("Несуществующее значение:", my_dict.get ("Семен", "Отсутствует"))
my_dict.update ({"Семён" : 2010, "Евгений" : 2008})
a = my_dict. pop ("Сергей")
print ("Удаленное значение:", a, "г.")
print ("Словарь обновленный:", my_dict)

# М н о ж е с в о
my_set = {3.14, "Трансформатор", 1, 5, 15, 25, 15}
print ("Комплект:", my_set)
my_set.update ([871, "Гамма"])
my_set.remove  (3.14)
my_set.remove  ("Трансформатор")
print ("Mодифицированный набор:", my_set)

